package Homework09_Day05_µµ¼­´ë¿©;

import java.util.Random;
import java.util.Scanner;
//22-03-17
public class µµ¼­´ë¿©5 {
/*	===================================================
		¹®Á¦Á¡
			1. ·Î±×ÀÎ ½ÇÆĞ ½Ã ·Î±×ÀÎ ½ÇÆĞ ¸Ş¼¼Áö ¼³Á¤ ½ÇÆĞ
			Q) Å×½ºÆ® °á°ú ·Î±×ÀÎ ½ÇÆĞ ¸Ş¼¼Áö ¼³Á¤ ½Ã ·Î±×ÀÎ ½ÇÆĞ ¸Ş¼¼Áö ÀÌÈÄ break °¡ ¾øÀ» °æ¿ì
			   °ü¸®ÀÚ ·Î±×ÀÎ ¼º°ø È®ÀÎ  ==> ¿Ö ±×·±°ÍÀÎÁö?
			   ==> °ü¸®ÀÚ ·Î±×ÀÎ ¹æ½ÄÀÌ Àß¸øµÇ¾ú´ÂÁö?
			2. È¸¿øÀÌ ¹İ³³ ¸Ş´º ¼±ÅÃ ½Ã ´ëÃâ µµ¼­°¡ ¾øÀ» °æ¿ì ¹İ³³ ºÒ°¡´É ÄÚµå ±¸Çö ½ÇÆĞ
			   ==> ´ëÃâ µµ¼­ ¾øÀ» °æ¿ì ´Â ±¸Çö Çß¾úÀ¸³ª ¹Ù·Î ¹İ³³ ÄÚµå·Î ÁøÀÔ ¤Ğ¤Ğ... 
				
			
	*/
	/*
	»ç¿ë¹®¹ı 1. ÀÔÃâ·Â 2.º¯¼ö/ÀÚ·áÇü/¿¬»ê  3.Á¦¾î/¹İº¹ 4.Á¦¾î/¹İº¹ 5.¹è¿­
	* µµ¼­ ´ë¿© console ÇÁ·Î±×·¥
	1. ¹è¿­ º¯¼ö
		1. È¸¿ø [ ¾ÆÀÌµğ(Áßº¹x) , ºñ¹Ğ¹øÈ£ ]
		2. µµ¼­ [ µµ¼­¸í(Áßº¹x) , µµ¼­´ë¿©¿©ºÎ(´ë¿©°¡´É,´ë¿©Áß) , ´ë¿©ÀÎ(·Î±×ÀÎ½Ã ¾ÆÀÌµğ) ]
	2. ÃÊ±â¸Ş´º
		1.È¸¿ø°¡ÀÔ 2.·Î±×ÀÎ 
			1.È¸¿ø°¡ÀÔ½Ã ¾ÆÀÌµğ Áßº¹Ã¼Å© 
			2.·Î±×ÀÎ ¼º°ø½Ã ·Î±×ÀÎ¸Ş´º , ·Î±×ÀÎ ½ÇÆĞ½Ã ·Î±×ÀÎ½ÇÆĞ Ãâ·Â 
	3. ·Î±×ÀÎ½Ã ¸Ş´º 
		1. µµ¼­°Ë»ö 2.µµ¼­¸ñ·Ï 3.µµ¼­´ë¿© 4.µµ¼­¹İ³³ 5.·Î±×¾Æ¿ô
 			1. µµ¼­°Ë»ö½Ã µµ¼­¸íÀÌ ÀÏÄ¡ÇÏ¸é µµ¼­¸í°ú µµ¼­´ë¿©¿©ºÎ Ãâ·Â
			2. µµ¼­¸ñ·Ï½Ã ¸ğµç µµ¼­¸í Ãâ·Â 
			3. µµ¼­´ë¿©½Ã µµ¼­´ë¿©¿©ºÎ°¡ °¡´ÉÇÒ¶§ µµ¼­´ë¿© Ã³¸®
			4. µµ¼­¹İ³³½Ã º»ÀÎÀÌ ´ë¿©ÇÑ µµ¼­¸¸ ¹İ³³ Ã³¸® 
			5. ·Î±×¾Æ¿ô ÃÊ±â¸Ş´º·Î 
	4. ·Î±×ÀÎ½Ã ¾ÆÀÌµğ°¡ admin ÀÌ¸é °ü¸®ÀÚ¸Ş´º 
		1. µµ¼­µî·Ï 2.µµ¼­¸ñ·Ï 3.µµ¼­»èÁ¦(µµÀü) 4.·Î±×¾Æ¿ô
			1. µµ¼­µî·Ï½Ã µµ¼­¸íÀ» ÀÔ·Â¹Ş¾Æ µµ¼­ µî·ÏÃ³¸®
			2. µµ¼­¸ñ·Ï½Ã ¸ğµç µµ¼­¸í Ãâ·Â 
			3. µµ¼­»èÁ¦½Ã »èÁ¦ÇÒ µµ¼­¸íÀ» ÀÔ·Â¹Ş¾Æ µ¿ÀÏÇÑ µµ¼­¸í »èÁ¦[ null ]
			4. ·Î±×¾Æ¿ô½Ã ÃÊ±â¸Ş´º·Î 
	*/ //13.08 | pause 13:17 | re 18:17 | pause 18:43 | re 19:00 | pause 19:40 |re 19:50
	// end 21:12
	public static void main(String[] args) {// ¸ŞÀÎ ½ÃÀÛ 
//		1. ¹è¿­ º¯¼ö
//		1. È¸¿ø [ ¾ÆÀÌµğ(Áßº¹x) , ºñ¹Ğ¹øÈ£ ]
		String[][] È¸¿ø = new String[100][3];  // È¸¿ø Á¤º¸ ÀúÀåÇÒ  2Â÷¿ø ¹è¿­ ¼³Á¤
		String[][] µµ¼­ = new String[10][3];   // µµ¼­ Á¤º¸ ÀúÀåÇÒ 2Ã¢­ ¹è¿­ ¼³Á¤
		
//		 admin ¼³Á¤ (³­¼ö·Î ·£´ıÇÑ ¹è¿­¿¡ admin µî·Ï ) 
		Random random = new Random();  // ·£´ı °´Ã¼ ·Îµå
		int admin_address = random.nextInt(È¸¿ø.length);  //È¸¿ø ¹è¿­ ±æÀÌ³»ÀÇ ¼ıÀÚ ³­¼ö ¹ß»ı
		String admin_ID ="admin"; // °ü¸®ÀÚ id ¼³Á¤
		String admin_PW ="admin"; // °ü¸®ÀÚ pw ¼³Á¤
		È¸¿ø[admin_address][0] = admin_ID; È¸¿ø[admin_address][1] = admin_PW;  // ¹ß»ıÇÑ ³­¼ö·Î ÀÓÀÇÀÇ È¸¿ø ¹è¿­ n¹øÂ° ÀÎµ¦½º¿¡ id¿Í ºñ¹Ğ¹øÈ£ ÀúÀå
		// admin µî·Ï È®ÀÎ
//		System.out.println(admin_address);
//		System.out.println(È¸¿ø[admin_address][0]);
//		System.out.println(È¸¿ø[admin_address][1]);
//		
		
		
		// ¹è¿­ ¼±¾ğ ¿Ï·á
		
		while(true) { // master while start ¹«ÇÑ·çÇÁ ½ÃÀÛ
			Scanner scanner = new Scanner(System.in);// ÀÔ·Â°´Ã¼ ·Îµå 
			
			System.out.println("================"); 
			System.out.print("1.È¸¿ø°¡ÀÔ 2. ·Î±×ÀÎ"); int ÃÊ±â¼±ÅÃ = scanner.nextInt(); // È¸¿ø°¡ÀÔ ¶Ç´Â ·Î±×ÀÎ ¼±ÅÃ¿ë º¯¼ö ÀÔ·Â
			
			if(ÃÊ±â¼±ÅÃ == 1) {  //È¸¿ø¤¡ °¡ÀÔ ¼±ÅÃ ½Ã
				// È¸¿ø°¡ÀÔ
				// 1. È¸¿ø°¡ÀÔ [ ¾ÆÀÌµğ , ºñ¹Ğ¹øÈ£ , ÀÌ¸§ ]
				
				//1-1 È¸¿ø°¡ÀÔ
				//1-2 id Áßº¹ Ã¼Å©
				// È¸¿ø°¡ÀÔ¿ë ³»¿ë ÀÔ·Â
				
				System.out.print("id : "); String id=scanner.next();  // id ¿Í ºñ¹Ğ¹øÈ£ ÀÔ·Â
				System.out.print("pw : "); String pw=scanner.next();
				
				//1-2 Áßº¹Ã¼Å©
				
				boolean check = true;  // ½ºÀ§Ä¡¿ë  Ã¼Å© º¯¼ö  ¼³Á¤ (Åë°ú
				for(int i =0; i<È¸¿ø.length;i++) {  // 0ºÎÅÍ È¸¿ø ¹è¿­ Å©±â¸¸Å­ ¹İº¹¹® ½ÃÀÛ 
					if(È¸¿ø[i][0]!=null&&È¸¿ø[i][0].equals(id)) {// È¸¿ø¹è¿­ÀÇ i¹øÂ° 0ÀÇ ¹è¿­ÀÌ null ÀÌ ¾Æ´Ï°í ÀÔ·ÂÇÑ id¿Í °°À¸¸é
						System.out.println("ÀÌ¹Ì »ç¿ëÇÏ°í ÀÖ´Â idÀÔ´Ï´Ù."); // Áßº¹µÈ id Ãâ·Â
						check = false; // À§ Á¶°Ç ¸¸Á· ½Ã ½ÇÆĞ 
						break;  // ¹İº¹¹®(for_ Å»Ãâ
					}
				}//Áßº¹Ã¼Å© ¿Ï·á
				
				if(check== true) { // À§ ¹İº¹¹® Á¶°Ç ¸¸Á· ½Ã º¯¼ö check°¡ Åë°úÀÌ¹Ç·Î if¹® ½ÃÀÛ
				//ÀÔ·Â ¿Ï·á
					for (int i = 0 ; i < È¸¿ø.length ; i++) { //  0ºÎÅÍ È¸¿ø ¹è¿­ Å©±â¸¸Å­ ¹İº¹¹® ½ÃÀÛ 
						if(È¸¿ø[i][0]==null) { // È¸¿ø¹è¿­ÀÇ i¹øÂ° 0ÀÇ ¹è¿­ÀÌ null ÀÌ¸é
							È¸¿ø[i][0] = id; È¸¿ø[i][1] = pw; // i¹øÂ° 0¿¡ id¸¦, i¹øÂ° 1¿¡ ºñ¹Ğ¹øÈ£ ´ëÀÔ
							System.out.println("È¸¿ø°¡ÀÔ ¿Ï·á"); // È¸¿ø°¡ÀÔ ¿Ï·á Ãâ·Â
							break;// À§ Á¶°Ç ¸¸Á· ½Ã for¹® Á¾·á
						}//È¸¿ø°¡ÀÔ ¿Ï·á 1-1
					}
				}
				
			}
			else if(ÃÊ±â¼±ÅÃ == 2) { // ·Î±×ÀÎ ¸Ş´º ¼±ÅÃ
				//	// 2. ·Î±×ÀÎ [ ¾ÆÀÌµğ , ºñ¹Ğ¹øÈ£ µ¿ÀÏÇÏ¸é ·Î±×ÀÎÃ³¸® ]
				System.out.println("================");
				System.out.print(" id :"); String id=scanner.next(); // id¿Í pw ÀÔ·Â 
				System.out.print(" pw :"); String pw=scanner.next();
				//ÀÔ·Â¿Ï·á
				//id ºñ¹ø µ¿ÀÏ½Ã ·Î±ä Ã¼Å©
				boolean check = false; //·Î±×ÀÎ ¿Ï·á½Ã true => ·Î±×ÀÎ ¸Ş´º ÁøÇà¿ë 
				for (int i=0;i<È¸¿ø.length;i++) { //È¸¿ø¹è¿­ÀÇ i¹øÂ° 0ÀÇ ¹è¿­ÀÌ null ÀÌ ¾Æ´Ï°í
					if(È¸¿ø[i][0]!=null&&È¸¿ø[i][0].equals(id)&&È¸¿ø[i][1].equals(pw)) {//È¸¿ø¹è¿­ÀÇ i¹øÂ° 0ÀÇ ¹è¿­ÀÌ null ÀÌ ¾Æ´Ï°í
						//i¹øÂ° 0,i¹øÂ° 1¿¡ °¢°¢  ÀÔ·ÂÇÑ id¿Í pw°¡ °°À¸¸é
						System.out.println("·Î±×ÀÎ ¿Ï·á"); //·Î±×ÀÎ ¿Ï·á Ãâ·Â
						check = true; // check º¯¼ö true ¼³Á¤
						
						
							while(check) { // sub ¹«ÇÑ¹İº¹ ½ÃÀÛ [ Á¾·áÁ¶°Ç : ·Î±×¾Æ¿ô ]
							if(admin_ID.equals(id)) { // ÀÔ·ÂÇÑ id ¿Í °ü¸®ÀÚ id ¿Í °°À¸¸é
								
								System.out.println(" ====°ü¸®ÀÚ ¸Ş´º===="); // °ü¸®ÀÚ ¸Ş´º È£Ãâ
								System.out.print("1.µµ¼­µî·Ï 2.µµ¼­¸ñ·Ï 3.µµ¼­»èÁ¦ 4.·Î±×¾Æ¿ô | ¼±ÅÃ :>"); int ad=scanner.nextInt(); // °ü¸®ÀÚ¸Ş´º ¼±ÅÃ
							
									if(ad==1) { //1 µµ¼­µî·Ï ½ÃÀÛ  1. µµ¼­µî·Ï½Ã µµ¼­¸íÀ» ÀÔ·Â¹Ş¾Æ µµ¼­ µî·ÏÃ³¸® 
												//µµ¼­¸íÀ¸·Î µî·Ï => : µµ¼­¸í / µµ¼­ ´ë¿© ¿©ºÎ / ´ë¿©ÀÚ
										System.out.print(" µî·ÏÇÒ µµ¼­ ¸í : "); String µµ¼­¸í= scanner.next();
//										µµ¼­¸í ÀÔ·Â ¿Ï·á
//										 µµ¼­¸í µµ¼­ ¹è¿­ ÀÔ·Â ½ÃÀÛ 
										for (int j=0;j<µµ¼­.length;j++) {// 0ºÎÅÍ µµ¼­ Å©±â ¸¹Å­ ¹İº¹¹® ½ÃÀÛ(1¾¿Áõ°¡)
											if(µµ¼­[j][0]==null) { // µµ¼­ ¹è¿­ÀÇ j,0 ¹øÂ° ¹è¿­ÀÌ null ÀÌ¸é
												µµ¼­[j][0] = µµ¼­¸í; µµ¼­[j][1] = "°¡´É"; µµ¼­[j][2] = "-";// ºñ¾îÀÖ´Â ¹è¿­¿¡ µµ¼­¸í, "µµ¼­´ë¿©°¡´É¿©ºÎ ¼³Á¤, 
												System.out.println(" µµ¼­ µî·Ï ¿Ï·á"); // µµ¼­µî·Ï ¿Ï·á Ãâ·Â 
												break;// µî·Ï ¿Ï·á½Ã ¹İº¹¹® Á¾·á
											}
										}
									}else if(ad==2) { // µµ¼­ ¸ñ·Ï  ¼±ÅÃ
										
										System.out.println("===================================");	
										System.out.println("¹øÈ£\t µµ¼­¸í \t´ë¿©°¡´É¿©ºÎ\t ´ë¿©ÀÚ");  // µµ¼­ ¸ñ·Ï ºÒ·¯¿À±â ¹øÈ£ µµ¼­¸í ´ë¿©°¡´É¿©ºÎ ´ë¿©ÀÚ Ãâ·Â
										for (int j =0 ; j<µµ¼­.length;j++) { // 0ºÎÅÍ µµ¼­ Å©±â¸¸Å­ ¹İº¹¹® ½ÃÇà
											if(µµ¼­[j][0]!=null&&µµ¼­[j][1]!=null&&µµ¼­[j][2]!=null) { // µµ¼­ÀÇ °¢ ¹è¿­ÀÇ °ªÀÌ null ÀÌ ¾Æ´Ï¸é
											System.out.printf("%d\t%s\t%s\t\t%s \n",j+1,µµ¼­[j][0],µµ¼­[j][1],µµ¼­[j][2]);
											}// j+1(¹øÈ£) , µµ¼­¸í,µµ¼­´ë¿©°¡´É¿©ºÎ,´ë¿©ÀÚ Ãâ·Â
										}
									}
									else if(ad==3) { //µµ¼­ »èÁ¦  ¼±ÅÃ
										System.out.print("»èÁ¦ÇÒ µµ¼­¸¦(¹øÈ£) ¼±ÅÃÇÏ¼¼¿ä : "); // µµ¼­»èÁ¦¿ë  ¸Ş¼¼Áö Ãâ·Â 
										int »èÁ¦=scanner.nextInt(); //»èÁ¦ = »èÁ¦ÇÒ µµ¼­ ÀÎµ¦½º(¹øÈ£)
										boolean del= true;; // del º¯¼ö¿¡ true ¼³Á¤
									
										if(µµ¼­[»èÁ¦-1][1]=="´ë¿©Áß") { // ÀÔ·ÂÇÑ ÀÎµ¦½ºÀÇ µµ¼­¹è¿­ÀÇ ÀÎµ¦½º-1,1¿¡ ´ë¿©ÁßÀÌ¶ó´Â °ªÀÌ ÀÖÀ¸¸é
											System.out.println(" ´ë¿©ÁßÀÎ µµ¼­ ÀÔ´Ï´Ù."); // ´ë¿©ÁßÀÌ¶ó´Â ¸Ş¼¼Áö Ãâ·Â
											del=false; // À§ Á¶°Ç ½Ã µµ¼­ »èÁ¦ ½ÇÆĞ
											
										}
										else if(del==true) { // ´ë¿©ÁßÀÌ ¾Æ´Ñ µµ¼­ ¼±ÅÃ ½Ã 
											System.out.print("¼±ÅÃÇÏ½Å µµ¼­¸¦ »èÁ¦ÇÕ´Ï´Ù. "); // ¼±ÅÃÇÑ µµ¼­ »èÁ¦ ¾È³» ¸Ş½ÃÁö
											µµ¼­[»èÁ¦-1][0] =null;  µµ¼­[»èÁ¦-1][1] =null; µµ¼­[»èÁ¦-1][2] =null;
											//µµ¼­ ¹è¿­ÀÇ ¼±ÅÃÇÑ À§Ä¡ÀÇ ¹è¿­ÀÇ °ªÀ» null·Î ¼³Á¤ 

											int k=»èÁ¦-1; // ÀÎµ¦½º ¶¯±â±â½ÃÀÛ // ÀÔ·ÂÇÑ °ª-1 ·Î k ¼³Á¤
											for(int j=k;j<µµ¼­.length;j++) { // ÀÔ·ÂÇÑ °ª-1 ºÎÅÍ µµ¼­ÀÇ Å©±â ¸¸Å­ 1¾¿Áõ°¡ÇÏ¸é¼­ ¹İº¹¹® ½ÃÇà  
												if(j==µµ¼­.length-1) { // jÀÇ °ªÀÌ µµ¼­¹è¿­ÀÇ Å©±â -1 °ú °°¾ÆÁø´Ù¸é
													µµ¼­[µµ¼­.length-1][0]=null; // µµ¼­¹è¿­ÀÇ (µµ¼­ Å©±â-1),0¹øÂ° °ªÀ» null·Î Ã³¸®
													µµ¼­[µµ¼­.length-1][1]=null;// µµ¼­¹è¿­ÀÇ (µµ¼­ Å©±â-1),1¹øÂ° °ªÀ» null·Î Ã³¸®
													µµ¼­[µµ¼­.length-1][2]=null;// µµ¼­¹è¿­ÀÇ (µµ¼­ Å©±â-1),2¹øÂ° °ªÀ» null·Î Ã³¸®
													break; // Á¶°Ç ¸¸Á· ½Ã for ¹® Á¾·á
												}
											µµ¼­[j] = µµ¼­[j+1]; // µµ¼­ ¹è¿­ÀÇj¹øÂ° ÀÎµ¦½º¸¦ j+1 ¹øÂ° ¹è¿­¤··Î ´ëÀÔ   =>1¹øÂ°±î 2¹øÂ° ¹è¿­·Î 
											}
										}
										}
										
									else if(ad==4) { // 4¹ø ¼±ÅÃ )·Î±×¾Æ¿ô)
										System.out.println(" ·Î±×¾Æ¿ô ÇÕ´Ï´Ù."); //·Î±×¾Æ¿ô ¸Ş¼¼Áö Ãâ·Â
										break; // ·Î±×ÀÎ¿ë ¸Ş´º Å»Ãâ(=°ü¸®ÀÚ ¸Ş´º Å»Ãâ) => È¸¿ø°¡ÀÔ&·Î±×ÀÎ ¸Ş´º·Î ÀÌµ¿
										}
											
									else {System.out.println("Àß¸øµÈ ÀÔ·ÂÀÔ´Ï´Ù. ");} //1~4 ¿Ü ÀÔ·Â½Ã Ãâ·Â 
								
							}
							else if (!"admin".equals(id)) {	 // °ü¸®ÀÚ ¸Ş´º ¿Ü È¸¿ø·Î±×ÀÎ ½Ã Ç¥½ÃµÇ´Â È¸¿ø ¸Ş´º ¼³Á¤
									System.out.println("=========================");
									System.out.print("1.µµ¼­°Ë»ö 2.µµ¼­¸ñ·Ï 3.µµ¼­´ë¿© 4.µµ¼­¹İ³³ 5.·Î±×¾Æ¿ô"); int È¸¿ø¼±ÅÃ=scanner.nextInt();
									// ÀÏ¹İ È¸¿ø¿ë ¸Ş´º , ¸Ş´º ¼±ÅÃ ÀÔ·Â
									if(È¸¿ø¼±ÅÃ==1 ) { // µµ¼­°Ë»ö ¼±ÅÃ 
										System.out.println("°Ë»ö ÇÒ µµ¼­"); String °Ë»öµµ¼­ = scanner.next(); //µµ¼­°Ë»ö¿ë ÀÔ·Â°´Ã¼ ÀÔ·Â
										for(int j = 0 ; j<µµ¼­.length;j++) { // 0ºÎÅÍ µµ¼­¹è¿­ÀÇ Å©±â¸¸Å­ 1¾¿ Áõ°¡ÇÏ¸é¼­ ¹İº¹¹® ½ÃÇà
											if(µµ¼­[j][0]!=null&&µµ¼­[j][0].equals(°Ë»öµµ¼­)) { // µµ¼­ ¹è¿­ÀÇ j,0¹øÂ° °ªÀÌnull ¾Æ´Ï°í °Ë»öµµ¼­¿Í ÀÏÄ¡ÇÏ¸é
												System.out.println("=======================");// °Ë»öµµ¼­¿¡ °ü·ÃµÈ ³»¿ë Ãâ·Â 
												System.out.println("µµ¼­¸í\t ´ëÃâ¿©ºÎ\t ´ëÃâÀÚ"); // ³»¿ëÀº µµ¼­¸í ´ëÃâ¿©ºÎ ´ëÃâÀÚ Ãâ·Â
												System.out.printf("%s\t%s\t%s\n",µµ¼­[j][0],µµ¼­[j][1],µµ¼­[j][2]);// ½ÇÁ¦ ³»¿ë Ãâ·Â,µµ¼­¸í, °¡´É¿©ºÎ,´©°¡ºô¤©·È´ÂÁö 
											}
										}
									}
									else if(È¸¿ø¼±ÅÃ==2) { // µµ¼­ ¸ñ·Ï È£Ãâ
										System.out.println("==================================="); 	
										System.out.println("¹øÈ£\t µµ¼­¸í \t´ë¿©°¡´É¿©ºÎ\t ´ë¿©ÀÚ"); // µî·ÏµÈ µµ¼­ÀÇ ¹øÈ£(¼ø¼­) µµ¼­¸í ´ë¿©°¡´É¿©ºÎ ´ë¿©ÀÚ »öÀÎ È£Ãâ
										for (int j =0 ; j<µµ¼­.length;j++) { // 0ºÎÅÍ µµ¼­¹è¿­ÀÇ Å©±â¸¸Å­ 1¾¿ Áõ°¡ÇÏ¸é¼­ ¹İº¹¹® ½ÃÇà
											if(µµ¼­[j][0]!=null&&µµ¼­[j][1]!=null&&µµ¼­[j][2]!=null) { // µµ¼­¹è¿­ÀÇ j,0¹øÂ° j,1¹øÂ°, j,2¹ø¤Š ¹è¿­ÀÇ °ªÀÌ nullÀÌ ¾Æ´Ò¶§
											System.out.printf("%d\t%s\t%s\t%s \n",j+1,µµ¼­[j][0],µµ¼­[j][1],µµ¼­[j][2]);
											}// »öÀÎ¿¡ °ü·ÃµÈ ³»¿ë Ãâ·Â (µî·ÏµÈ µµ¼­ ¸ğµÎ Ãâ·Â)
										}
									}
									else if(È¸¿ø¼±ÅÃ==3) { //3.µµ¼­´ë¿© ¼±ÅÃ
										System.out.print("´ë¿©ÇÏ½Ç Ã¥  ÀÔ·ÂÇÏ¼¼¿ä"); String ´ë¿©¼±ÅÃ=scanner.next(); // ´ë¿©ÇÒ Ã¥ Á¦¸ñ ÀÔ·Â
										for(int k=0;k<µµ¼­.length;k++) {// 0 ºÎÅÍ µµ¼­ Å©±â¸¸Å­ 1¾¿ Áõ°¡ÇÏ¸é¼­ ¹İº¹¹® ½ÃÇà
											if(µµ¼­[k][1]=="´ë¿©Áß") { // k,1¹øÂ° ÀÇ °ªÀÌ ´ë¿©ÁßÀÏ ‹š 
												System.out.println("´ë¿©ÁßÀÎ µµ¼­ÀÔ´Ï´Ù ´ë¿©°¡ µÇÁö ¾Ê½À´Ï´Ù."); //´ë¿© ºÒ°¡´É ¸Ş¼¼Áö Ãâ·Â
												break; // ´ë¿© ½ÇÆĞ  ¹İº¹¹® Á¾·á
											}
										}
										
										//»ó±â Á¶°Ç¿¡ ºñ ¸¸Á·½Ã
										for (int j =0 ; j<µµ¼­.length;j++) {  //0 ºÎÅÍ µµ¼­ Å©±â¸¸Å­ 1¾¿ Áõ°¡ÇÏ¸é¼­ ¹İº¹¹® ½ÃÇà
											if(µµ¼­[j][0]!=null&&µµ¼­[j][0].equals(´ë¿©¼±ÅÃ)){// j,0ÀÇ °ªÀÌ nullÀÌ ¾Æ´Ï°í j,0ÀÇ °ªÀÌ ÀÔ·ÂÇÑ µµ¼­¸í°ú °°À¸¸é
											µµ¼­[j][1]="´ë¿©Áß"; µµ¼­[j][2]=id; // j,1¹øÂ°¿¡ ´ë¿©Áß ÀúÀå, 2¹øÂ° °ª¿£ ·Î±×ÀÎÇÑ id °ª ÀúÀå 
											È¸¿ø[j][2]=µµ¼­[j][0]; // È¸¿øÀÇ 2¿£ µµ¼­¸í ÀÔ·Â
											System.out.println("´ë¿© ¿Ï·á"); // À§ Á¶°Ç ¸¸Á· ½Ã ´ë¿© ¿Ï·á ¸Ş¼¼Áö Ãâ·Â
											break;// µµ¼­ ´ë¿©¿ë ¹İº¹¹® Á¾·á
											}
										}
									}
									else if(È¸¿ø¼±ÅÃ==4) {
										 // µµ¼­ ¹İ³³¿ë ¸Ş´º ¼±ÅÃ
									
												System.out.println(" ´ë¿©ÇÑ Ã¥À» ¹İ³³ÇÕ´Ï´Ù."); // ¹İ³³ ¸Ş¼¼Áö Ãâ·Â
												for (int k =0 ; k<µµ¼­.length;k++) {  //0 ºÎÅÍ µµ¼­ Å©±â¸¸Å­ 1¾¿ Áõ°¡ÇÏ¸é¼­ ¹İº¹¹® ½ÃÇà
													if(µµ¼­[k][2]!=null&&µµ¼­[k][2].equals(id)) {//µµ¼­ ¹è¿­ÀÇ kÇà ÀÇ id(ÀúÀåµÈ È¸¿ø id) °¡ null ÀÌ ¾Æ´Ï°í
														// ÀúÀåµÈ id¿Í ·Î±×ÀÎ¿ë ÀÔ·ÂÇÑ id°¡ °°À¸¸é
														µµ¼­[k][1]="°¡´É"; µµ¼­[k][2]="-"; //µµ¼­´Â ´ë¿© °¡´É Ã³¸®/ ´ë¿©ÀÚ °ª ÃÊ±âÈ­
													}
											}
								
										}
									else if(È¸¿ø¼±ÅÃ==5) { // ·Î±×¾Æ¿ô ¸Ş´º ¼±ÅÃ
										System.out.println("·Î±×¾Æ¿ô");// ·Î±×¾Æ¿ô ¸Ş¼¼Áö Ãâ·Â 
										break;//µµ¼­´ë¿© ÇÁ·Î±×·¥ ·Î±×¾Æ¿ô (sub whileÁ¾·á) => È¸¿ø°¡ÀÔ&·Î±×ÀÎ ¸Ş´º ÀÌµ¿
									}
									else {}
								}//else 
			
						}
					}
//					else {System.out.println("ÀÏÄ¡ÇÏ´Â Á¤º¸°¡ ¾ø½À´Ï´Ù.");break;}
				}
				
			}//if 2 end		
			else { System.out.println(" Àß¸øµÈ ÀÔ·ÂÀÔ´Ï´Ù. ");} // Àß¸øµÈ °© ÀÔ·Â ½Ã Ãâ·Â ¸Ş¼¼Áö
		}// while end
			
		
	}//main end
}//class end